---
title: Markdown语法测试
layout: default
---




# 哈弗曼压缩算法

利用Huffman编码算法进行文件的无损压缩。

## 算法步骤

1. 统计每个字符的出现频度。
2. 按频度合并构造出霍夫曼二叉树。
3. 由二叉树生成每个字符对应的非前缀二进制编码。

该过程体现在代码中如下所示：
<code>

	void Huffman_apply(Huffman *h) {

    	Huffman_count_frequencies(h);

    	Huffman_build_tree(h);

    	Huffman_generate_codes(h);
	}

</code>


## 压缩文件格式
1. 编码字符个数: 4byte
2. 所有(字符, 频度): (1 + 4)*编码字符个数 byte
3. 按序存储原文件字节对应的编码 未知长度
4. 上一字节的结束位置: 1byte


## 内部实现
1. multimap有序存储字符及其频度 


## 问题
1. 是否只能压缩文本文件：并不是。Huffman编码的初衷是问了压缩字符，但如果把这个字符的概念扩展就可以处理任何文件。1个字节8个bit，有256种不同的情况。把这256种不同的字节都视作“字母”。统计这256种“字母”的频度即可。

2. 文件最后一个字节：由于一个字节的编码会小于1个字节，压缩文件的最后一个字节可能会写不满。因此在末尾再添加一个字节记录上一字节的结束为止。
